Repository: atlas-studios/Session2-G2
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 上青界最近出了一件大事，听闻四大世家之一的轩辕家，有族人在下界惹到了两名剑修。结果人家气不过，直接追到上界不说，还直捣黄龙的杀到了轩辕主家。
en_us: Something had shaken the Upper Azure World recently. Word was going around that a group of people from one of the four aristocratic families, the Xuan Yuan Family, went to the Lower Realm and offended two sword cultivators. The sword cultivators got upset and followed the group of people all the way back to the Upper Azure World. They even managed to attack the master of the Xuan Yuan Family.

source: 上青界最近出了件大事，传闻化神魔修虞蒙被人杀了。就连他手下那群血债累累的魔修，也被人一锅端了。一夜之间，困扰上青界已久，连四大世家都没有办法的魔窟断空涯被清了个干净。
en_us: Something big had happened in the Upper Azure World recently: word was going around that the Soul Formation Fiendish Cultivator Yu Meng had been killed. Even his subordinate Fiendish Cultivators who had killed many people were gone. Sky Severance Cliff, the Fiend Den which even the aristocratic families had trouble getting rid of, had been wiped out overnight.

source: 上青界的人为什么会来中青界宗门？
en_us: Why were people from the Upper Azure World at a sect in the Middle Azure World?

source: 上青界的资源就这么多，对于世家而言，这样的新生力量，无非就是两种处理方式，交好或是打压。很明显印郁轩辕三家，都是采取的拉拢交好的方式。而郁家失了先机，于是选了另外一种。
en_us: The Upper Azure World had an abundance of resources. For the aristocratic families, there were only two ways to handle such new arising power; either to befriend or suppress. It was obvious that all three Yin, Yu, and Xuan Yuan Family were trying to pull strings and befriend them. Since the Yu Family had missed out on the first strike, they chose the other approach.

source: 上青界顿时傻了眼，莫非……那两个剑修真有这样的本事，连世家的游仙长老，都不敢轻易招惹？
en_us: The Upper Azure World was left confused. Could it be… that the two sword cultivators were so capable that even a Traveling Immortal Elder of an aristocratic family did not dare to provoke them?

source: 上青界，轩辕世家。
en_us: Upper Azure World, Xuan Yuan Family.

source: 下一刻。
en_us: The next moment...

source: 下一刻两人的身影同时一闪，直接交战了起来。印元飞是难得一见的雷灵根，每一招都带着电光，加上他本身修为就高，不到片刻间，场上到处都是他招出来的雷鸣之声。逼得思羽几乎没有立足之地。
en_us: In the next moment, both of them moved to start the fight. Yin Yuanfei had a rare lightning-elemental Spirit Root. Each of his moves generated a flash of lightning. Given his high cultivation level, the stage was filled with the sound of his lightning bolts in seconds. Si Yu had almost no space left to stand in.

source: 下一刻只见他身上灵气暴涨，连着四周迷蔓的仙气都涌动了起来，他的修为肉眼可见的开始极速飚升。
en_us: The next moment, his Spirit Qi surged, and the Immortal Qi around him began to stir as well. His cultivation level began to soar visibly.

source: 下一刻羿清化出满天灵剑朝着两人追了上去，瞬间阻断他们的所有退路，铺天盖地的往两人攻了上去。
en_us: The next moment, Yi Qing manifested a sky full of spirit swords and chased after the two of them, blocking off all roads of escape and going for a full on attack.

source: 下一刻，一道男音就传了出来。
en_us: The next moment, a male voice rang out.

source: 下一刻，一道黑色的风刃，带着糜烂的气息，咚的一声砸到了易峰头上。倾刻间直接把他撞飞了出去。落叶一般在空中翻了好几个跟头，若不是他反应快，及时御剑而起，顺手布下了防御阵。否则就被下方接连不断的黑色风刃贯穿了。
en_us: The next moment, a black wind blade with a fast dissipating aura flew toward Yi Feng's head. Yi Feng flew backward on impact, turning several rounds in the air like a fallen leaf. He quickly mounted his flying sword and summoned a defensive array. If not for his quick reaction, he would still have been attacked by the black wind blade.

source: 下一刻，他听到了浅浅的呼噜声。
en_us: The next moment, he heard a faint snore.

source: 下一刻，地上的阵法转成了红色，那些被砍落的荆棘藤蔓里突然散发出大量的黑气，倾刻间迷蔓整个竹林，一股刺骨的寒意侵蚀着四周。
en_us: The next moment, the array formation on the ground turned red, and those thistles and vines that were chopped off suddenly disintegrated into copious amounts of black smoke. In the blink of an eye, the whole forest was engulfed in the smoke and the surroundings became extremely chilly.

source: 下一瞬间让他更加吃惊的是，那无名口诀修炼的出来的黑色元力，和江水决修炼出来的蓝色水系元力碰撞在一起，却没发生他想象中的絮乱，反而水乳交融般完美融合到了一起，在经脉内自由游走。
en_us: in the next instant, he was astonished to see that the black essence force cultivated from the nameless chant collided with the blue essence force cultivated from the Jiang Water Art. However, instead of throwing his body into disorder as he imagined, the two types of essence force mixed perfectly together like water and milk. They freely circulated through his arteries without even a tussle.

source: 下方是整个曲双城的全貌，仙脉之上的曲双城仙气缭绕，城中满是仙气。城外却相对要稀薄一些，以致于整个曲双城从上方看起来隔外突出。更突出的是它的形状，原本仙城是没有固定的样子的，入了仙城若想长住，得了城主允许，便可在城内建房，所以城中地域很广。
en_us: Below is the full view of Qushuang City. Being on top of the immortal pulse, Qushuang City was enclosed by a thick mist of immortal Qi. There were much immortal Qi inside the city but outside the city, the immortal Qi is much lesser comparatively, which makes the entire Qushuang City stand out more from above. The thing that stands out the most is the shape of the city. Originally, immortal cities do not have a fixed look. If one wants to stay in the city for good, he or she needs to ask the City Lord for permission before building their house in the city. Hence the city's land is very extensive.

source: 不不不，羿清立马甩开了这个可笑想法，师父这么强大，怎么可能只会这种小孩打架的招式，不可能的？！
en_us: No, no, no. Yi Qing immediately dismissed this ridiculous idea. Master was so strong, how could she know only this style of kid-fighting. Impossible!?

source: 不会是做梦吧？说好的没修为呢喂？一拳打暴整个城什么的，这修为破天了吧！
en_us: This isn’t a dream, is it? Where's the lack of cultivation? One punch to destroy the entire town—that cultivation is off the charts!

source: 不出江逸的意料之外，丹炉又是一声炸响，而在他不抱任何希望揭开炉盖的时候，却意外发现有三枚丹药竟然没炸，安静的躺在丹炉内。上面黑光流转，隐隐还有纹路，看起来异常漂亮。
en_us: As Jiang Yi expected, an explosive sound rang out of the elixir cauldron. Yet when he lifted the cauldron lid without any prior expectations, he unexpectedly discovered three of the elixir pills had actually not exploded at all, but were instead lying silently in the cauldron. The top of the pills had black light circulating about, with the pills having a faint vein-like pattern - the pills looked strangely pretty.

source: 不出江逸的意料之外，风月楼的刘管事很快得到了他和江小奴的资料，马飞的父亲也暴怒无比，下令让刘管事派人探查江逸行踪，一有机会直接做了他。
en_us: Just as Jiang Yi expected, Housekeeper Liu of Fengyue Brothel had soon obtained his and Jiang Xiaonu's information. Also as Jiang Yi predicted, Ma Fei's father was livid and ordered Housekeeper Liu to send someone on Jiang Yi's trail, and to take him out at the first opportunity.

source: 不出江逸的意料之外，黑色元力融合元力丹药力后，他提炼江水决的速度果然快了数倍。感受这丹田内的蓝色元力不断快速产生，江逸暗暗激动起来。如果他有大量的丹药，依靠着黑色元力增幅，就算有这鬼封印，他依旧可以快速修炼了。尽管他未来的成就还是有限，但最少修炼到铸鼎境四五重什么的不是难事。
en_us: As expected, after the black essence force merged with the medicinal power of the essence force pill, the speed at which he was refining with the Jiang Water Art did indeed increase severalfold. Jiang Yi grew excited as he felt the blue essence force in his dantian continuously and speedily get produced. If he had a large number of elixirs and continued relying on black essence force to expand the power of the elixirs, even with this stupid seal, he could continue to speedily refine essence force. Even though his future accomplishments were limited, at least it would not be difficult for him to reach the fourth or fifth level of the Cast Tripod Realm.

source: 不到一会，只听到咚的一声，他再次出现，随手把手里的人扔在了地上，倒在了沈萤的旁边。
en_us: Within a moment, with a ploping sound, he appeared again as he threw a person on the ground to lay beside Shen Ying.

source: 不到三息时间，他们就到了一片完全陌生的密林之中，空中充斥比外面浓郁几十倍的灵气，令人精神一震。他看了看四周却没有发现先一步进来的青尹一行，也没有其它修士的踪影。
en_us: In less than ten seconds, they found themselves in a completely foreign forest. The air in the mystic realm was filled with Spirit Qi, tens of times denser than the air outside. It was shocking, to say the least. Surveying his surroundings, Lonemoon couldn't find any sign of Qing Yin or the other cultivators who had entered just minutes before them.

source: 不到两刻钟的功夫，它已经脱去了魔骨变成了一条小青蛟。只是额头那只黑色的蛟龙角不见了。修为也直接掉落了大半，跟之前那只背云兽一样，是十三阶。
en_us: Within two minutes, the wyrm had gotten rid of all of its demonic bones and had become a little green wyrm. It no longer had the black horn on its head. Its cultivation level also dropped nearly by half - it was now a thirteenth-level beast, just like the Cloud-Bearing Beast.

source: 不到半个时辰的功夫，印风一点消息没得到，反而被对方掏了个底朝天，还初步定下了，以高一倍的市场价格，长期购买无敌派灵植，并由轩辕家免费炼制成丹的约定。
en_us: Within the space of an hour, not only did Yin Feng not manage to get any information out of his counterparts, but was instead completely out-foxed by them. Both parties had settled on terms of an initial deal whereby Yin Feng would pay twice the market price for the long-term purchase of spirit herbs while the Xuan Yuan Family would refine the herbs into elixir pills for free.

source: 不到半个时辰，孤月已经整整抗过了八十道劫雷，全身已经不成人形了。虽然雷劫落下后，带着的仙气可以修复他的身体，但修复的速度明显赶不上雷落下的速度，他已经是个血人了。
en_us: In less than an hour, Lonemoon had withstood eighty bolts of lightning tribulation. His entire body was so battered that he was almost unrecognizable as a human being. Although the immortal Qi that followed each strike could mend his body, the rate of healing could not keep up with the frequency of the strikes; he was totally covered in blood.

source: 不到半会两个黑影缓缓从里面走了出来，皆是一身灰袍，走在前面一个人呵呵一笑，露出半张瘦得皮包骨般的脸，“呵，原来是无常魔尊在此，毕浩打扰了。”
en_us: A moment later, two black shadows slowly came out of from the forest, both donned in grey robes. The person walking in front smiled, revealing half of their bony face. "Heh, so it was Fiend Supremacy Impermanence over here. Sorry to intrude."

source: 不到半会的功夫，刚刚还硬气得不得了的仙人，已经被打得不成人形了，嘴里的血像是小喷泉似的，时不时噗噗噗的往外喷。
en_us: Within minutes, the immortal who had been so cocky before was beaten beyond recognition. He spat blood out of his mouth so that his mouth began to look like a blood fountain.

source: 不到半会的时间，孤月身上已经出现了数道伤口，但就算被逼入了绝境，他眼神仍是没有焦距，连神情都没变动一下。直到羿清突然召出剑意，一把熟悉的金色巨剑出，瞬间朝着他劈了下去。
en_us: Lonemoon's body was covered in wounds after just a few moments and looked like it was in a critical state, yet his eyes still did not focus and his expression remained the same. Yi Qing suddenly summoned his sword intent and drew a familiar Great Golden Sword, thrusting it in Lonemoon's direction.

source: 不到半会，之前那道天光再次出现，比之刚刚孤月出现的时候，这次出现了数十道。只是不知为何，刚刚那个声音却没有再出现。
en_us: The bright light from before suddenly appeared again after a moment. Except, when Lonemoon appeared earlier there was only one flash of bright light. Now, there were ten. However, the voice that sounded out before no did not say a word this time.

source: 不到半会，地面就出现了一个大坑，坑深不见底，隐隐还有着浓烈的腥臭味从里面散发出来。
en_us: Within moments, a huge pit appeared on the ground. The pit was so deep that one could not see to the bottom and there was a pungent smell emanating from within.

source: 不到半会，就传来熟睡的呼噜声。
en_us: Moments later, a familiar sound of snoring could be heard.

source: 不到半刻的功夫，眼睛动了动，醒了过来。
en_us: Moments later, his eyes moved a little and he came to.

source: 不同人体之间，力气难免会有误差，但在元力的绝对优势面前，这种差距一般是微不足道的。
en_us: Between two individuals, there would no doubt be some difference in strength but the difference would normally be negligible.

source: 不同系别，不同颜色的元力之间要想融合，有着苛刻的条件。至少在铸鼎境这种境界，不同系别的元力之间就算轻轻碰触一下都会出大问题，轻则元力絮乱走火入魔，重则经脉断裂受重伤，丹田爆裂成废人，这是天星大陆人尽皆知的常识。
en_us: there were strict criteria in order for two different techniques or two different colored essence force to fuse. At least within the Cast Tripod realm, different essence force clashing lightly was enough to create a big problem. The repercussions spanned from the minor problem of having a Qi deviation due to chaotic essence force to the major problem of being seriously injured due to cracked meridians. The explosion of a dantian might even reduce a person into a cripple. This was common knowledge for all on the Stellarsky Continent.

source: 不好！
en_us: No good!

source: 不对！那不是灵气，是仙气！
en_us: Wait, that wasn't Spirit Qi - it was Immortal QI!

source: 不对，他们沉下心一感应，发现火焰最猛烈的地方，居然迷蔓几乎要凝成实质的灵气，这是……仙气！
en_us: No, something was not right. Stilling their minds, they used their senses to probe their surroundings, and discovered that, at a spot where the fire was most intense, swirled a miasma of Spirit Qi that was so dense as to be almost palpable. It was… Immortal Qi!

source: 不对，那羽毛真的在发光。
en_us: Something was not right; the feathers were actually emitting light.

source: 不带这么开挂的，师父开挂就算了，为啥徒弟也这么挂。这才多久啊，就从一个金丹修士，直接升上了化神。这太尼玛不仙法了。
en_us: He hadn't known he had brought along two cheats. It was enough that the master was a cheat. Who knew that the disciple would be such a cheat as well? It had only been a while, yet he had grown from being a Golden Core stage cultivator to a Soul Formation stage cultivator. This was ridiculous.

source: 不得不说沈萤今晚发的这顿飙，飙得大了点。一下折了对方五个游仙的修为不说，连郁家家主都被废了。这对世家而言不止是伤筋动骨，简直就是粉碎性骨折，这事要是传开了这上青界恐怕就只剩三大世家了。虽然不知道那救人的是谁，但必有后招。
en_us: Shen Ying's rampage tonight was too extreme. In one move, she not only seriously injured five Traveling Imomortals from the Yu Family, she even injured the Master of the Yu Family. They didn't just suffer from torn ligaments and minor fractures - all their bones were nearly shattered. If word goes out in the Upper Azure World, there might only be three aristocratic families left. Although they still don't know exactly who saved the Yu Family, it seemed like the Yu Family had something up their sleeves.

source: 不得不说牛爸爸为了打消两人的念头，也是蛮拼的。唯一一点不好解释的是，为什么他们会有这么多体修？但很明显心灵受到了重大创伤的薄家父子，并没有想到这一点。不过门下弟子们的实力确实应该提升了，至少要先生出仙骨。
en_us: Speaking of this, Father Niu really deserves a mention for how hard he tried to get those two to give up on their plans. The only question that would be hard to explain, was 'How will they have so many Body cultivators'. Clearly, this question did not ring a bell and was not asked by the deeply saddened Pu father and son. Indeed, some improvements should be of abilities should be observed from the disciple, or at least some sight of immortal bones.

source: 不得不说，做为一个无神论者，她一开始真的被吓了一跳。但饿得狠了，也就顾不上管这种怪力乱神的事了，再说她人都已经穿越了，世界不同，还不许动物有些变异了？
en_us: Being an atheist, she was utterly shocked in the beginning. Yet, as her hunger persisted, she could not care less about strange powers and deities. She had already transmigrated to a different world, how was it hard for her to accept that some animals were a little different?

source: 不愧是他的师父，他果然拜对了师门！
en_us: She was indeed worthy to be his Master, he had chosen the right teacher!

source: 不愧是大仙，收小弟都是最强的，就算不强创造条件也要变成最强。
en_us: No wonder she was a Great Immortal—even her followers were the strongest of the strong. Even when conditions were not favorable, one had to create the conditions and emerge as the strongest.

source: 不明真相的众弟子：“……”化神尊者加元婴真人带队，这次历练的难度是突破天际了吗？
en_us: The disciples, still in the dark: "…" The Soul Formation Supremacy and the Nascent Soul Perfected One are leading the team. This must mean that the level of difficulty on this experiential training mission is off the scale!

source: 不是好人的易峰：“……”
en_us: The so-called bad Yi Feng: "..."

source: 不用想他们定是去了秘境。
en_us: Needless to say, they were headed for the mystic realm.

source: 不知过了多久，有个身长数十丈的猪首冥将终于忍不住问。
en_us: After a long while, a Netherworld general in the form of a dozen-foot-tall pig-man could not help but ask,

source: 不知过了多久，院外突然响起一声怒意十足的大喊，江逸听到那个声音立刻心头一震，从打坐中清醒过来，暗道不妙。
en_us: He had no idea how long had passed when he heard an enraged roar ringing from the courtyard outside. Upon hearing that voice, Jiang Yi was immediately startled awake from his meditation. His heart beat rapidly; he knew something was amiss.

source: 不知道是不是受伤太重，她居然没有推动，反到是自己退了两步。拼命压下心头涌上的气血，这才沉声看向那人。
en_us: Qi Chengyu didn't know if it was the lack of strength caused by her severe injuries, but she was unable to push the person away. Instead, it was she who staggered a couple of steps back. She had to use all her strength to suppress the blood from rushing to her heart. She then turned to look at Shen Ying.

source: 不知道，看来她还真没修过仙！
en_us: She doesn't know, it seems that she really hasn't practiced immortal cultivation!

source: 不管这个所谓的无敌派在哪里，以她们现在的情况，进入妖界反到对她们有利。况且眼前这个女子，看起来完全没有任何修为，真要打起来她们自然不惧。唯一要提防的是那个笑得一脸讨好，拼命想往女子身边蹭，一个眼神都没给过众人，名唤萝卜的男子，看他刚刚变身的情景，难道也是只妖？
en_us: No matter where this so-called Invincible Sect was located at, with the current situation they were in, entering the Demon Realm might be beneficial instead. Moreover, this girl leading them did not seem to have any cultivation. If they were to fight, they did not need fear her. The only thing they needed to be wary of was that man going by the name of Radish who kept trying to stay by that girl's side with a fawning smile and did not even look at the rest of the people. Having witnessed his transformation, they wondered: could he also be a demon?

source: 不能炼制丹药，他的黑色元力怎么注入丹药内？
en_us: If he could not even refine any elixirs, how could he inject any black essence force into the elixirs?

source: 不行！
en_us: No way!

source: 不过三位公子很快醒悟过来，认为这是姬听雨在在刻意躲开他们，也不好多说讪讪的站在原地。
en_us: However, the three gentlemen quickly woke up from their astonished trances. They all thought that it was Ji Tingyu's attempt to deliberately avoid them and as such was unwilling to comment any further. Instead, feeling embarrassed, they stood around at their original spots.

source: 不过他倒是不敢出声，老老实实的站着，内心期望这柳长老心情大好，可以放他一马。
en_us: However, he did not dare to make a sound. Instead, he merely stood there like he was well-behaved, hoping in his heart that with his excellent mood, Elder Liu would let him off the hook.

source: 不过他倒是很聪明，知道此地不宜久留，否则伤的将会更加严重。他惦着一条腿朝外面艰难逃去，走到外面见江逸没有追来，才满眼怨毒的咬牙切齿说道：“江逸，你竟然敢伤我？你死定了，我一定会让虎哥打死你的，你有种一辈子不出江家大院，嘶……”
en_us: Nonetheless, he was very smart. He realized that it was imperative to leave, otherwise his injuries would worsen. He thought of relying on one leg alone to escape, and did so with much difficulty. When he reached the door and saw that Jiang Yi wasn't pursuing him, he gritted his teeth in bitter resentment. "Jiang Yi, how dare you injure me? You're dead. I will definitely let Brother Hu beat you to death. If you have the balls, don't think of leaving the central court! Hiss..."

source: 不过他到是不担心门现在会打开，毕竟在剧情之中，想要打开界门，需要极大的代价，且需要魔族血脉为引。
en_us: However, Lonemoon was not that worried about whether the door would open now as according to the storyline, if one wishes to open the door of the realm, he or she would need to pay a huge price, and would even need the Demonic tribe bloodline to lead.

source: 不过他转念想到江小奴那瘦弱的身躯，他很快摇头道：“姬小姐，你是高高在上的小姐，你永远不会了解我们这种人的生活，嗯……长不说这些了，你找我是有什么事吧？”
en_us: However, once he thought of Jiang Xiaonu and her scrawny figure, he shook his head quickly, "Young Mistress Ji, you stand high above the masses and will never understand the lives of people like us. Mm... let's not dwell on this topic any more. You must be looking for me for some reason?"

source: 不过传承嘛，传给谁都一样，反正他早就已经死了，现在只是一片残魂而已。
en_us: It was just a heritage — he could hand it down to anyone. He was going to die anyway; he was only a remnant soul now..

source: 不过姬听雨这次却并没有内疚之色，反而摇头轻笑，一双如宝石般的眸子内都是慑人光芒，她款款而谈：“易公子，不遭人妒是庸才，这个世界有很多美好的东西，值得我们去追求。而这些东西人人都想要，那势必会有竞争，麻烦肯定也会不断，没有追求的人生，那是不完美的人生。人的一辈子匆匆数十载，红颜易老，刹那芳华！你想庸庸碌碌过一辈子，还是想轰轰烈烈，风风光光的过上十年？”
en_us: However, Ji Tingyu did not express any remorse this time. With her gem-like orbs shining with startling beauty, she shook her head and smiled, speaking slowly but pointedly, "Young Master Yi, only the mediocre does not attract the jealousy of others. There are so many wonderful things in this world that are worth pursuing, things that everyone wants. Certainly, it creates competition and incessant trouble, but imagine how imperfect life would be without a cause. A lifetime lasts but a fleeting handful decades; beauty and youth fade away in an instant! Do you prefer a lifetime of mediocrity, or a zealous, glorious decade?"

source: 不过对于这些他倒是并不在意，那群公子小姐和他的人生太过遥远，他也不想和她们有什么交集，他目光投向翊凌雪道：“翊小姐也不错，这段时间我感觉你战力是飞快提升，你所有的武技都大成了吧？境界也快提升到铸鼎境五重了吧？”
en_us: Nevertheless, Jiang Yi did not care too much about any of that. Those young masters and young mistresses were living a life far different from his, and he did not wish to cross paths with them. He cast a look at Yi Lingxue, "Young Mistress Yi is not doing too bad yourself. I can feel your powers rising fast during this period, haven't all of your martial art techniques attained phenomenal success yet? You must be elevating to the fifth stage of the Cast Tripod Realm too?"

source: 不过江逸既然开口了，她也不好抹他的面子，而且进了练功房不随便对练一场也会引起别人怀疑的。江逸能带来拥有丹纹的丹药这事，姬听雨可不想别人知道，于是含笑道：“易公子请放手一战！”
en_us: However, since Jiang Yi offered, she did not feel it was right to be so impolite and let him lose face that way. Besides, having already entered the Technique Practising Room, not having a martial arts combat match with a sparring partner would raise suspicions over what happened. Ji Tingyu had no wish to let others know the circumstance that Jiang Yi could bring in elixirs with vein patterns. As such, she smiled and replied, "Young Master Yi, please do not spare me either, and let's fight!"

source: 不过贺礼她拿就拿了，为啥……为啥要写血书啊喂？！
en_us: "But she could've just taken the gift. Why... why did she have to leave a note written with blood?"

source: 不过转头想到，在这做事似乎就不用外出上西山了？江如虎等人也不敢明着来这或者去他院子内动手吧？他正好有时间可以好好研究下黑色元力了。
en_us: However, he switched his thinking. If I take this job, I no longer have to go out to the Western Hills? Additionally, Jiang Ruhu and his gang would not dare to come here or go to my house and fight me, right? He had just the right time to carefully research the black essence force.

source: 不过转念江逸就明白了，这翊龙宇既然是翊家年轻一代的最强者，对于江家的武技显然也很是了解，轻松看出他用了江家的武技也正常。
en_us: Jiang Yi mulled it over for a moment before comprehension dawned: as the strongest martial artist among the younger generations in the Yi Family, he obviously would know a thing or two about the Jiang Clan's martial art techniques, and it would be easy for him to tell that the techniques Jiang Yi used belonged to the Jiang Clan.

source: 不过铸鼎境二重突破三重需要的元力是原先的一倍，他原来停留在铸鼎境一重也有一年多了，此刻要想突破铸鼎境三重，就算有如此恐怖的修炼速度，没有大半个月也是不可能的。
en_us: However, the amount of essence force needed to break through from the second to the third stage of the Cast Tripod Realm was double that of the original. His power-level had already been stuck at the first stage of the Cast Tripod Realm for over a year. To be able to break through to the third stage of the Cast Tripod Realm there and then, even if he had such obscenely fast essence force cultivation speed, it would be impossible to accomplish this breakthrough without spending more than half a month in cultivation practice.

source: 不过铸鼎境前四重好突破，要想突破后面的境界就非常困难了，铸鼎境五重是道坎，需要的元力差不多是前面所有境界的总和。所以很多纨绔子弟，天资不行的武者境界都停留在铸鼎境四重，毕竟他们家族再富有也不可能用无尽的丹药让他们强行突破到铸鼎境五重，比如江如虎，又比如马飞。
en_us: On the other hand, while it was easy to achieve the first four stages of the Cast Tripod Realm, making a breakthrough to each of the subsequent stages was much more difficult. The fifth stage of the Cast Tripod Realm, in particular, was a bottleneck, the essence force needed was roughly the sum of all the previous stages. As such, many wastrel playboys and inept martial artists like Jiang Ruhu and Ma Fei, were permanently held up at the fourth stage of the Cast Tripod Realm. After all, it would be impossible for their families, however rich they might be, to keep supplying them with elixirs to forcibly elevate to the fifth stage of the Cast Tripod Realm.

source: 不过！
en_us: However!

source: 不重要的被揍追魂楼众人：“……”感觉日了狗！
en_us: The unimportant people from the Soul Chasing Tower that got beaten: "..." Damn it!

source: 不重要！
en_us: Not important!

source: 不，重要的是：
en_us: No, the important thing is...

source: 与之前第一道不同，这次是接连劈下来，都不带歇气的那种。似是要将孤月全身劈开，再重组成一般。一道比一道凶狠。
en_us: Unlike the first strike, this time the lightning struck down one after another without a break. It was as if it wanted to split Lonemoon's body apart to reorganise it. Each strike was more devastating than the last.

source: 与此同时正在梦乡中的高人萤，砸吧砸吧了嘴，突然无意识溢出一串梦呓，“呵呵，红烧肉……辣子鸡……麻婆豆腐……”
en_us: At the same time, the soundly asleep Expert Ying smacked her lips together and all of a sudden, she began to unconsciously talk in her sleep, "Heh heh, braised meat in brown sauce… Chicken with Szechuan pepper… Szechuan-style bean curd…"

source: 与此同时，万妖殿。
en_us: Meanwhile, at the Myriad Demon Temple.
